; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	image0 - mode
	infrared1 - mode
	image3 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image3)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image3)
	(supports instrument5 image0)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument6 image0)
	(supports instrument6 image2)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 infrared1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument9 image2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument10 image2)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument11 image0)
	(supports instrument11 image2)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet10)
)
(:goal (and
	(pointing satellite1 Star9)
	(pointing satellite2 Star9)
	(pointing satellite4 Star6)
	(pointing satellite6 GroundStation3)
	(have_image Phenomenon5 image0)
	(have_image Star6 image0)
	(have_image Phenomenon7 image0)
	(have_image Star8 image2)
	(have_image Star9 image3)
	(have_image Planet10 image2)
	(have_image Star11 image3)
))

)

; plan
1. (turn_to satellite4 star6 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 star6)
   goals met: 1 of 11
2. (turn_to satellite2 star9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star9)
   goals met: 2 of 11
3. (turn_to satellite1 groundstation2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 11
4. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 11
5. (calibrate satellite1 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 2 of 11
6. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 2 of 11
7. (take_image satellite1 planet10 instrument5 image2)
   added: (have_image planet10 image2)
   goals met: 3 of 11
8. (turn_to satellite1 phenomenon7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 11
9. (take_image satellite1 phenomenon7 instrument5 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 11
10. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 11
11. (take_image satellite1 phenomenon5 instrument5 image0)
   added: (have_image phenomenon5 image0)
   goals met: 5 of 11
12. (turn_to satellite1 star11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star11)
   goals met: 5 of 11
13. (take_image satellite1 star11 instrument5 image3)
   added: (have_image star11 image3)
   goals met: 6 of 11
14. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 6 of 11
15. (take_image satellite1 star6 instrument5 image0)
   added: (have_image star6 image0)
   goals met: 7 of 11
16. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 7 of 11
17. (take_image satellite1 star8 instrument5 image2)
   added: (have_image star8 image2)
   goals met: 8 of 11
18. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 9 of 11
19. (take_image satellite1 star9 instrument5 image3)
   added: (have_image star9 image3)
   goals met: 10 of 11
20. (turn_to satellite6 groundstation3 planet10)
   deleted: (pointing satellite6 planet10)
   added: (pointing satellite6 groundstation3)
   goals met: 11 of 11
